app/views/messages/index.html.erb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ?  [["followed_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 2]]
---
<% if user_signed_in? %>
<% current_user.active_relationships.each do |followed| %>
<% user = User.find(followed.followed_id) %>
<% user.messages.each do |message| %>