app/views/messages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
       <p class="comment-posted-by">By: <%= user.email %> <%= time_ago_in_words(user.created_at) %> Ago</p>
      <%= render '/messages/follow_button', :user => User.find(user.id) %>