app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"  ORDER BY created_at DESC
---
  def index
    @messages = Message.all.order("created_at DESC")

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Sample"], ["description", "This is a sample message\r\n"], ["user_id", 1], ["created_at", "2020-01-08 07:12:37.914078"], ["updated_at", "2020-01-08 07:12:37.914078"]]
---
  def create
    @message = current_user.messages.build(message_params)
    if @message.save

UPDATE "messages" SET "title" = ?, "url" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["title", "Freshworks opens development centre in Hyderabad"], ["url", "https://economictimes.indiatimes.com/topic/Freshworks"], ["updated_at", "2020-01-12 17:13:00.953652"], ["id", 10]]
---
  def update
    if @message.update(message_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 13]]
---
  def upvote
    @message = Message.find(params[:id])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 13]]
---
  def downvote
    @message = Message.find(params[:id])

SELECT "users".* FROM "users"
---
  def profile
    @user = User.all

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]
---
  def find_message
    @message = Message.find(params[:id])